/*******************************************************************************
****文件路径         : \low_delay_net_display\api\AdjustClkApi.h
****文件版本         : V1.0.0
****创建日期         : 2023-02-14 21:55:51
****简要说明         : 主要实现动态调整vsync的接口，以保证发送端和接收端的
****                   帧率保持稳定，最终达到延迟时间的稳定。
****版权信息         : 2023 by rockchip, All Rights Reserved.
********************************************************************************/

#ifndef INCLUDE_ADJUST_CLK_H_
#define INCLUDE_ADJUST_CLK_H_
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

enum FPS_TYPE
{
    SEND_TYPE = 0,
    RECV_TYPE
} ;

/*******************************************************************************
****函数功能: 通过回调设置vcnt的时间点，vcnt的时间点是由VO生成的。
****入口参数: 无
****出口参数: 无
****函数备注: 需要回调，主要是为了获取准确的时间点
********************************************************************************/
typedef void (*VSYNC_SETVCNT_CB)();

/*******************************************************************************
****函数功能: VSYNC的线程，这个线程主要基于帧率统计，进行相应的clk调整
****入口参数: drmFd：DRM设置节点的句柄
****出口参数: 无
****函数备注:
********************************************************************************/
int   VsyncTread(int drmFd);

/*******************************************************************************
****函数功能: 线程退出。
****入口参数: 无
****出口参数: 无
****函数备注:
********************************************************************************/
void  VsyncThreadExit();

/*******************************************************************************
****函数功能: 设置VO buffer的时间点。
****入口参数: vo_time：设置VO buffer的时间点
****出口参数: 无
****函数备注:
********************************************************************************/
void  SetVoTime(RK_U32 vo_time);

/*******************************************************************************
****函数功能: 通过回调获取vcnt的时间点，然后设置到 vsync。
****入口参数: vcnt_time:vcnt的时间点，就是VO配置寄存器的时间点。
****出口参数: 无
****函数备注:
********************************************************************************/
void  SetVcntTime(RK_U32 vcnt_time);

//以下是demo中辅助demo的接口实现。
/*******************************************************************************
****函数功能: 设置显示类型。
****入口参数: display_type：HDMI:0,DP:1,EDP:2,DSI:3
****出口参数: 无
****函数备注:
********************************************************************************/
void  SetDisplayType(int display_type);

/*******************************************************************************
****函数功能: 统计VSYNC的帧率。
****入口参数: type：发送端：0，接收端：1
****出口参数: 无
****函数备注:
********************************************************************************/
float ShowFps(FPS_TYPE type);

/*******************************************************************************
****函数功能: 获取VCNT的回调接口函数。
****入口参数: VSYNC_SETVCNT_CB：回调函数定义
****出口参数: 无
****函数备注:
********************************************************************************/
void  SetVsyncCallback(VSYNC_SETVCNT_CB func);

/*******************************************************************************
****函数功能: 设置预计发送端的帧率。
****入口参数: fps：发送端的帧率
****出口参数: 无
****函数备注:
********************************************************************************/
void  SetSendFps(float fps);



#endif
